import n7 from "../../../../public/images/n7.png";
import n8 from "../../../../public/images/n8.png";
import n9 from "../../../../public/images/n9.png";
import n10 from "../../../../public/images/n10.png";
import CardEndsSections from "./CardEndsSections";

function EndsSections() {
  const details = [
    {
      id: "1",
      title: "مرجع بانک مشاغل ایران",
      description:
        "خدمات صادرات و واردات شامل مجموعه‌ای از فعالیت‌ها است که به تسهیل انتقال کالا و خدمات بین کشورها کمک می‌کند. این خدمات شامل مشاوره تجاری برای ورود به بازارهای بین‌المللی، ترخیص کالا و مدیریت فرآیندهای گمرکی، حمل و نقل بین‌المللی و بیمه بار می‌باشد. همچنین، تأمین مالی تجارت و ارائه تحقیقات بازار برای شناسایی فرصت‌های تجاری نیز از بخش‌های کلیدی این خدمات هستند. هدف اصلی این خدمات، تسهیل در دسترسی به بازارهای جهانی و کاهش ریسک‌های مرتبط با تجارت بین‌المللی است.",
      image_number: n7,
      bttn_details: "رفتن به بانک آرمان",
      bttn_link: "https://bankarman.com/",
    },
    {
      id: "2",
      title: "بستر عمده فروشی آرمان کمپانی",
      description:
        "خدمات صادرات و واردات شامل مجموعه‌ای از فعالیت‌ها است که به تسهیل انتقال کالا و خدمات بین کشورها کمک می‌کند. این خدمات شامل مشاوره تجاری برای ورود به بازارهای بین‌المللی، ترخیص کالا و مدیریت فرآیندهای گمرکی، حمل و نقل بین‌المللی و بیمه بار می‌باشد. همچنین، تأمین مالی تجارت و ارائه تحقیقات بازار برای شناسایی فرصت‌های تجاری نیز از بخش‌های کلیدی این خدمات هستند. هدف اصلی این خدمات، تسهیل در دسترسی به بازارهای جهانی و کاهش ریسک‌های مرتبط با تجارت بین‌المللی است.",
      image_number: n8,
      bttn_details: "رفتن به بازار آرمان",
      bttn_link: "https://bazararman.com/",
    },
    {
      id: "3",
      title: "خبر گزاری آرمان نیوز",
      description:
        "خدمات صادرات و واردات شامل مجموعه‌ای از فعالیت‌ها است که به تسهیل انتقال کالا و خدمات بین کشورها کمک می‌کند. این خدمات شامل مشاوره تجاری برای ورود به بازارهای بین‌المللی، ترخیص کالا و مدیریت فرآیندهای گمرکی، حمل و نقل بین‌المللی و بیمه بار می‌باشد. همچنین، تأمین مالی تجارت و ارائه تحقیقات بازار برای شناسایی فرصت‌های تجاری نیز از بخش‌های کلیدی این خدمات هستند. هدف اصلی این خدمات، تسهیل در دسترسی به بازارهای جهانی و کاهش ریسک‌های مرتبط با تجارت بین‌المللی است.",
      image_number: n9,
      bttn_details: "رفتن به آرمان نیوز",
      bttn_link: "https://armannews.com/",
    },
    {
      id: "4",
      title: "آکادمی آموزشی آرمان لرنینگ",
      description:
        "خدمات صادرات و واردات شامل مجموعه‌ای از فعالیت‌ها است که به تسهیل انتقال کالا و خدمات بین کشورها کمک می‌کند. این خدمات شامل مشاوره تجاری برای ورود به بازارهای بین‌المللی، ترخیص کالا و مدیریت فرآیندهای گمرکی، حمل و نقل بین‌المللی و بیمه بار می‌باشد. همچنین، تأمین مالی تجارت و ارائه تحقیقات بازار برای شناسایی فرصت‌های تجاری نیز از بخش‌های کلیدی این خدمات هستند. هدف اصلی این خدمات، تسهیل در دسترسی به بازارهای جهانی و کاهش ریسک‌های مرتبط با تجارت بین‌المللی است.",
      image_number: n10,
      bttn_details: "رفتن به آرمان لرنینگ",
      bttn_link: "https://armanlearning.com/",
    },
  ];
  return (
    <>
      {details.map((detail) => (
        <CardEndsSections key={detail.id} detail={detail} />
      ))}
    </>
  );
}

export default EndsSections;
