import n1 from "../../../../public/images/n1.png";
import n2 from "../../../../public/images/n2.png";
import n3 from "../../../../public/images/n3.png";
import e2 from "../../../../public/images/export.png";
import Saler from "../../../../public/images/Saler.png";
import social from "../../../../public/images/social.png";
import CardFirstSection from "./CardFirstSection";

function FirstSection() {
  const services = [
    {
      id: "1",
      title: "صادرات و واردات آرمان",
      description:
        "خدمات صادرات و واردات شامل مجموعه‌ای از فعالیت‌ها است که به تسهیل انتقال کالا و خدمات بین کشورها کمک می‌کند. این خدمات شامل مشاوره تجاری برای ورود به بازارهای بین‌المللی، ترخیص کالا و مدیریت فرآیندهای گمرکی، حمل و نقل بین‌المللی و بیمه بار می‌باشد. همچنین، تأمین مالی تجارت و ارائه تحقیقات بازار برای شناسایی فرصت‌های تجاری نیز از بخش‌های کلیدی این خدمات هستند. هدف اصلی این خدمات، تسهیل در دسترسی به بازارهای جهانی و کاهش ریسک‌های مرتبط با تجارت بین‌المللی است.",
      categories: [
        {
          id: "11",
          title: "جذب مشتری",
          image: e2,
          paragraph:
            "خدمات صادرات و واردات شامل مجموعه‌ای از فعالیت‌ها است که به تسهیل انتقال کالا و خدمات بین کشورها کمک می‌کند. این خدمات شامل مشاوره تجاری برای ورود به بازارهای بین‌المللی، ترخیص کالا و مدیریت فرآیندهای گمرکی، حمل و نقل بین‌المللی و بیمه بار می‌باشد. همچنین، تأمین مالی تجارت و ارائه تحقیقات بازار برای شناسایی فرصت‌های تجاری نیز از بخش‌های کلیدی این خدمات هستند. هدف اصلی این خدمات، تسهیل در دسترسی به بازارهای جهانی و کاهش ریسک‌های مرتبط با تجارت بین‌المللی است.",
        },
        {
          id: "12",
          title: "مذاکره بازرگانی بین الملل",
          image: e2,
          paragraph:
            "خدمات صادرات و واردات شامل مجموعه‌ای از فعالیت‌ها است که به تسهیل انتقال کالا و خدمات بین کشورها کمک می‌کند. این خدمات شامل مشاوره تجاری برای ورود به بازارهای بین‌المللی، ترخیص کالا و مدیریت فرآیندهای گمرکی، حمل و نقل بین‌المللی و بیمه بار می‌باشد. همچنین، تأمین مالی تجارت و ارائه تحقیقات بازار برای شناسایی فرصت‌های تجاری نیز از بخش‌های کلیدی این خدمات هستند. هدف اصلی این خدمات، تسهیل در دسترسی به بازارهای جهانی و کاهش ریسک‌های مرتبط با تجارت بین‌المللی است.",
        },
        {
          id: "13",
          title: "خدمات گمرک",
          image: e2,
          paragraph:
            "خدمات صادرات و واردات شامل مجموعه‌ای از فعالیت‌ها است که به تسهیل انتقال کالا و خدمات بین کشورها کمک می‌کند. این خدمات شامل مشاوره تجاری برای ورود به بازارهای بین‌المللی، ترخیص کالا و مدیریت فرآیندهای گمرکی، حمل و نقل بین‌المللی و بیمه بار می‌باشد. همچنین، تأمین مالی تجارت و ارائه تحقیقات بازار برای شناسایی فرصت‌های تجاری نیز از بخش‌های کلیدی این خدمات هستند. هدف اصلی این خدمات، تسهیل در دسترسی به بازارهای جهانی و کاهش ریسک‌های مرتبط با تجارت بین‌المللی است.",
        },
        {
          id: "14",
          title: "مشاوره و آموزش",
          image: e2,
          paragraph:
            "خدمات صادرات و واردات شامل مجموعه‌ای از فعالیت‌ها است که به تسهیل انتقال کالا و خدمات بین کشورها کمک می‌کند. این خدمات شامل مشاوره تجاری برای ورود به بازارهای بین‌المللی، ترخیص کالا و مدیریت فرآیندهای گمرکی، حمل و نقل بین‌المللی و بیمه بار می‌باشد. همچنین، تأمین مالی تجارت و ارائه تحقیقات بازار برای شناسایی فرصت‌های تجاری نیز از بخش‌های کلیدی این خدمات هستند. هدف اصلی این خدمات، تسهیل در دسترسی به بازارهای جهانی و کاهش ریسک‌های مرتبط با تجارت بین‌المللی است.",
        },
        {
          id: "15",
          title: "اخذ نمایندگی",
          image: e2,
          paragraph:
            "خدمات صادرات و واردات شامل مجموعه‌ای از فعالیت‌ها است که به تسهیل انتقال کالا و خدمات بین کشورها کمک می‌کند. این خدمات شامل مشاوره تجاری برای ورود به بازارهای بین‌المللی، ترخیص کالا و مدیریت فرآیندهای گمرکی، حمل و نقل بین‌المللی و بیمه بار می‌باشد. همچنین، تأمین مالی تجارت و ارائه تحقیقات بازار برای شناسایی فرصت‌های تجاری نیز از بخش‌های کلیدی این خدمات هستند. هدف اصلی این خدمات، تسهیل در دسترسی به بازارهای جهانی و کاهش ریسک‌های مرتبط با تجارت بین‌المللی است.",
        },
      ],
      image_number: n1,
    },
    {
      id: "2",
      title: "بازاریابی و فروش آرمان",
      description:
        "خدمات صادرات و واردات شامل مجموعه‌ای از فعالیت‌ها است که به تسهیل انتقال کالا و خدمات بین کشورها کمک می‌کند. این خدمات شامل مشاوره تجاری برای ورود به بازارهای بین‌المللی، ترخیص کالا و مدیریت فرآیندهای گمرکی، حمل و نقل بین‌المللی و بیمه بار می‌باشد. همچنین، تأمین مالی تجارت و ارائه تحقیقات بازار برای شناسایی فرصت‌های تجاری نیز از بخش‌های کلیدی این خدمات هستند. هدف اصلی این خدمات، تسهیل در دسترسی به بازارهای جهانی و کاهش ریسک‌های مرتبط با تجارت بین‌المللی است.",
      categories: [
        {
          id: "21",
          title: "پشتیبانی کاربران",
          image: Saler,
          paragraph:
            "خدمات صادرات و واردات شامل مجموعه‌ای از فعالیت‌ها است که به تسهیل انتقال کالا و خدمات بین کشورها کمک می‌کند. این خدمات شامل مشاوره تجاری برای ورود به بازارهای بین‌المللی، ترخیص کالا و مدیریت فرآیندهای گمرکی، حمل و نقل بین‌المللی و بیمه بار می‌باشد. همچنین، تأمین مالی تجارت و ارائه تحقیقات بازار برای شناسایی فرصت‌های تجاری نیز از بخش‌های کلیدی این خدمات هستند. هدف اصلی این خدمات، تسهیل در دسترسی به بازارهای جهانی و کاهش ریسک‌های مرتبط با تجارت بین‌المللی است.",
        },
        {
          id: "22",
          title: "جذب مشتریان جدید",
          image: Saler,
          paragraph:
            "خدمات صادرات و واردات شامل مجموعه‌ای از فعالیت‌ها است که به تسهیل انتقال کالا و خدمات بین کشورها کمک می‌کند. این خدمات شامل مشاوره تجاری برای ورود به بازارهای بین‌المللی، ترخیص کالا و مدیریت فرآیندهای گمرکی، حمل و نقل بین‌المللی و بیمه بار می‌باشد. همچنین، تأمین مالی تجارت و ارائه تحقیقات بازار برای شناسایی فرصت‌های تجاری نیز از بخش‌های کلیدی این خدمات هستند. هدف اصلی این خدمات، تسهیل در دسترسی به بازارهای جهانی و کاهش ریسک‌های مرتبط با تجارت بین‌المللی است.",
        },
        {
          id: "23",
          title: "جلسات حضوری",
          image: Saler,
          paragraph:
            "خدمات صادرات و واردات شامل مجموعه‌ای از فعالیت‌ها است که به تسهیل انتقال کالا و خدمات بین کشورها کمک می‌کند. این خدمات شامل مشاوره تجاری برای ورود به بازارهای بین‌المللی، ترخیص کالا و مدیریت فرآیندهای گمرکی، حمل و نقل بین‌المللی و بیمه بار می‌باشد. همچنین، تأمین مالی تجارت و ارائه تحقیقات بازار برای شناسایی فرصت‌های تجاری نیز از بخش‌های کلیدی این خدمات هستند. هدف اصلی این خدمات، تسهیل در دسترسی به بازارهای جهانی و کاهش ریسک‌های مرتبط با تجارت بین‌المللی است.",
        },
        {
          id: "24",
          title: "مشاوره تلفنی",
          image: Saler,
          paragraph:
            "خدمات صادرات و واردات شامل مجموعه‌ای از فعالیت‌ها است که به تسهیل انتقال کالا و خدمات بین کشورها کمک می‌کند. این خدمات شامل مشاوره تجاری برای ورود به بازارهای بین‌المللی، ترخیص کالا و مدیریت فرآیندهای گمرکی، حمل و نقل بین‌المللی و بیمه بار می‌باشد. همچنین، تأمین مالی تجارت و ارائه تحقیقات بازار برای شناسایی فرصت‌های تجاری نیز از بخش‌های کلیدی این خدمات هستند. هدف اصلی این خدمات، تسهیل در دسترسی به بازارهای جهانی و کاهش ریسک‌های مرتبط با تجارت بین‌المللی است.",
        },
      ],
      image_number: n2,
    },
    {
      id: "3",
      title: "خدمات ثبتی، حقوقی و مالیاتی",
      description:
        "خدمات صادرات و واردات شامل مجموعه‌ای از فعالیت‌ها است که به تسهیل انتقال کالا و خدمات بین کشورها کمک می‌کند. این خدمات شامل مشاوره تجاری برای ورود به بازارهای بین‌المللی، ترخیص کالا و مدیریت فرآیندهای گمرکی، حمل و نقل بین‌المللی و بیمه بار می‌باشد. همچنین، تأمین مالی تجارت و ارائه تحقیقات بازار برای شناسایی فرصت‌های تجاری نیز از بخش‌های کلیدی این خدمات هستند. هدف اصلی این خدمات، تسهیل در دسترسی به بازارهای جهانی و کاهش ریسک‌های مرتبط با تجارت بین‌المللی است.",
      categories: [
        {
          id: "31",
          title: "وب سایت ها و فروم ها",
          image: social,
          paragraph:
            "خدمات صادرات و واردات شامل مجموعه‌ای از فعالیت‌ها است که به تسهیل انتقال کالا و خدمات بین کشورها کمک می‌کند. این خدمات شامل مشاوره تجاری برای ورود به بازارهای بین‌المللی، ترخیص کالا و مدیریت فرآیندهای گمرکی، حمل و نقل بین‌المللی و بیمه بار می‌باشد. همچنین، تأمین مالی تجارت و ارائه تحقیقات بازار برای شناسایی فرصت‌های تجاری نیز از بخش‌های کلیدی این خدمات هستند. هدف اصلی این خدمات، تسهیل در دسترسی به بازارهای جهانی و کاهش ریسک‌های مرتبط با تجارت بین‌المللی است.",
        },
        {
          id: "32",
          title: "تولید محتوای ویدئویی",
          image: social,
          paragraph:
            "خدمات صادرات و واردات شامل مجموعه‌ای از فعالیت‌ها است که به تسهیل انتقال کالا و خدمات بین کشورها کمک می‌کند. این خدمات شامل مشاوره تجاری برای ورود به بازارهای بین‌المللی، ترخیص کالا و مدیریت فرآیندهای گمرکی، حمل و نقل بین‌المللی و بیمه بار می‌باشد. همچنین، تأمین مالی تجارت و ارائه تحقیقات بازار برای شناسایی فرصت‌های تجاری نیز از بخش‌های کلیدی این خدمات هستند. هدف اصلی این خدمات، تسهیل در دسترسی به بازارهای جهانی و کاهش ریسک‌های مرتبط با تجارت بین‌المللی است.",
        },
        {
          id: "33",
          title: "کمپین های تبلیغاتی",
          image: social,
          paragraph:
            "خدمات صادرات و واردات شامل مجموعه‌ای از فعالیت‌ها است که به تسهیل انتقال کالا و خدمات بین کشورها کمک می‌کند. این خدمات شامل مشاوره تجاری برای ورود به بازارهای بین‌المللی، ترخیص کالا و مدیریت فرآیندهای گمرکی، حمل و نقل بین‌المللی و بیمه بار می‌باشد. همچنین، تأمین مالی تجارت و ارائه تحقیقات بازار برای شناسایی فرصت‌های تجاری نیز از بخش‌های کلیدی این خدمات هستند. هدف اصلی این خدمات، تسهیل در دسترسی به بازارهای جهانی و کاهش ریسک‌های مرتبط با تجارت بین‌المللی است.",
        },
        {
          id: "34",
          title: "ایجاد زیر ساخت ها",
          image: social,
          paragraph:
            "خدمات صادرات و واردات شامل مجموعه‌ای از فعالیت‌ها است که به تسهیل انتقال کالا و خدمات بین کشورها کمک می‌کند. این خدمات شامل مشاوره تجاری برای ورود به بازارهای بین‌المللی، ترخیص کالا و مدیریت فرآیندهای گمرکی، حمل و نقل بین‌المللی و بیمه بار می‌باشد. همچنین، تأمین مالی تجارت و ارائه تحقیقات بازار برای شناسایی فرصت‌های تجاری نیز از بخش‌های کلیدی این خدمات هستند. هدف اصلی این خدمات، تسهیل در دسترسی به بازارهای جهانی و کاهش ریسک‌های مرتبط با تجارت بین‌المللی اس4ت.",
        },
      ],
      image_number: n3,
    },
  ];
  return (
    <>
      {services.map((service) => (
        <CardFirstSection key={service.id} service={service} />
      ))}
    </>
  );
}

export default FirstSection;
