import styles from "./AboutPage.module.css";
import arman from "../../../public/images/arman.jpg";
import company from "../../../public/images/company.jpg";
import Image from "next/image";
import CustomerReviews from "../module/AboutPage/CustomerReviews";
function AboutPage() {
  return (
    <>
      <section className={styles.container}>
        <h1>درباره آرمان کمپانی</h1>
        <div className={styles.border}></div>
        <p>درباره ما بیشتر بدانید ...</p>
      </section>
      <div className={styles.main}>
        <div className={styles.right}>
          <h2>
            ما در&nbsp; <span>آرمان کمپانی</span> چه میکنیم؟
          </h2>
          <p>
            آرمان کمپانی، شرکتی فعال و یکی از پیشتازان در زمینه برندسازی و توسعه
            کسب و کارها است که در مهرماه سال 1396 تأسیس شد و با رویکردی نوین و
            خلاقانه و با تیمی متخصص و مجرب، به دنبال رفع نیازهای مشتریان در
            زمینه های مختلف برندسازی است. این شرکت با ارائه خدمات فوق العاده و
            با کیفیت در تمامی زمینه‌های برندسازی، از جمله طراحی، پشتیبانی و سئو
            سایت، اراِئه خدمات گرافیکی، پشتیبانی شبکه های اجتماعی، تبلیغات
            کلیکی، مجازی و محیطی، مفتخر است که به توسعه کسب و کارهای تاجران و
            مشتریانش کمک کند. در آغاز فعالیت‌، آرمان کمپانی به ارائه خدمات
            طراحی، پشتیبانی و سئوی سایت متمرکز شد و سپس با توسعه خدمات در سایر
            زمینه های برندسازی از جمله خدمات گرافیکی، شبکه های اجتماعی و تبلیغات
            مجازی و محیطی، توانسته ایم در این عرصه جایگاه برجسته‌ای داشته باشیم
            و به مشتریان خدماتی شفاف و سودمند ارائه دهیم. هدف ما، ایجاد روابط
            بلند مدت و پایدار با مشتریان، به عنوان شرکای تجاری مان است و تلاش ما
            برای این منظور، ما را به مرحله‌ای از اعتماد و همکاری بسیار بالا با
            آن ها می‌رساند. ما در آرمان کمپانی با تکیه بر توانایی های تخصصی، به
            عنوان یک شرکت پیشرو در صنعت برندسازی، به دنبال حل مسائل و ارائه راه
            حل های بهینه برای مشتریانمان هستیم و تلاش می‌کنیم تا با بهبود
            فرایندها و ارائه راهکارهایی هوشمندانه، بهترین تجربه کاری ممکن را
            برای شما عزیزان ایجاد کنیم. بهترین خدمات و بهترین قیمت ها را از ما
            بخواهید و ما با افتخار در خدمت شما هستیم تا نیازهای تجاری شما را
            برطرف کرده و با ارائه راهکارهای مناسب بهترین تجربه‌ی تجاری را برای
            شما به ارمغان آوریم.
          </p>
        </div>
        <div className={styles.left}>
          <Image src={arman} width={600} height={"auto"} alt="arman" />
        </div>
      </div>
      <div className={styles.main}>
        <div className={styles.left}>
          <Image src={company} width={600} height={"auto"} alt="company" />
        </div>
        <div className={styles.right}>
          <h2>
            هدف مجموعه&nbsp; <span>آرمان کمپانی</span>
          </h2>
          <p>از جمله اهداف آرمان کمپانی می‌توان به موارد زیر اشاره کرد:</p>
          <ol type="1">
            <li>
              <p>
                ارائه نرم‌افزارهای با کیفیت بالا: آرمان کمپانی با تلاش برای
                تولید نرم‌افزارهای با کیفیت بالا، سعی در جذب مشتریان جدید و حفظ
                مشتریان قبلی خود دارد.
              </p>
            </li>
            <li>
              <p>
                پشتیبانی 24 ساعته: گسترش شبکه پشتیبانی آنلاین و پاسخگوئی سريع به
                مشكلات كاربران، يكي ديگر از هدف های آن است.
              </p>
            </li>
            <li>
              <p>
                توسعه فناوري: آرمان کمپاني با رويكرد توسعه فناوري و استفاده از
                جديدترين تكنولوژي ها، سعی در بهبود محصولات خود دارد.
              </p>
            </li>
            <li>
              <p>
                افزایش رضایت مشتریان: آرمان کمپانی با تلاش برای افزایش رضایت
                مشتریان، به دنبال حفظ و گسترش بازار خود است.
              </p>
            </li>
            <li>
              <p>
                توسعه کسب و کار: آرمان کمپانی با تلاش برای توسعه کسب و کار خود،
                به دنبال افزایش درآمد و سودآوری است.
              </p>
            </li>
          </ol>
        </div>
      </div>
      <CustomerReviews />
    </>
  );
}

export default AboutPage;
